{
    "__comment": "link is the weblink for HELP button. Window is for the brief description for each dialog.",
    "Main Help Menu": {
        "link": "https://minijmp.readthedocs.io/en/latest/",
        "window": ""},
    "Stats Summary": {
        "link": "https://minijmp.readthedocs.io/en/latest/usage/describe.html",
        "window": "Generate statistical summaries such as Mean and Median for a single dataset, i.e. one column of data. The statistical measures are set by default, while percentile positions can be customized."},
    "Stats Summary Multi Datasets": {
        "link": "https://minijmp.readthedocs.io/en/latest/usage/describe_multivar.html",
        "window": "Generate statistical summaries, including measures such as Mean and Median, for multiple datasets (several columns of data). Users can select which statistical measures to include in the final output table."},
    "Normality Test": {
        "link": "https://minijmp.readthedocs.io/en/latest/usage/normality.html",
        "window": "Perform normality test to one column of data. Shapiro-Wilk and Anderson-Darling tests will be performed." 
    },
    "Confidence Intervals": {
        "link": "https://minijmp.readthedocs.io/en/latest/usage/ci.html",
        "window": "Calculate and display the confidence intervals for the population mean and standard deviation using the sampling dataset, assuming the underlying population follows a normal distribution."
    },
    "Fit Distributions": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/fit_dist.html",
        "window": "A fitted distribution is a theoretical distribution calculated using parameter estimates derived from a sample that you enter. This dialog can help to find the most suitable distribution to the sample. If plotting required, please use Plots>Histogram & Dist. Fit, however which can't compare across distributions."
    },
    "Correlation": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/cor.html",
        "window":"Calculate correlation between two data columns and draw a scatter plot. Correlation ellipse can be drawn when Pearson's Correlation is selected."
    },
    "Linear Regression": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/linear_fit.html",
        "window":"Find the linear model that best describes how the response variable (Y) changes with the predictor variable (X), using the least squares estimation method which minimizes the sum of the squared distances between the points and the fitted line. "
    },
    "Residual Plots": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/residuals.html",
        "window":"A supplimental tool of Linear Regression to plot Residuals versus fits, Residuals versus order, Histogram of residuals and QQ plot of normality test.\nChoose the predictor variable (X) and the response variable (Y) of the Linear Regression."
    },
    "Orthogonal Regression": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/orthogonal.html",
        "window":"Calculate the orthogonal regression of the variables, which considering both predictor and response carrying measurement errors."
    },
    "Multi Column Correlation": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/multi_cor.html",
        "window":"Select multiple variables using CTRL-click for individual selections or SHIFT-click for ranges. Calculate correlations simultaneously using one or multiple algorithm(s) of your choice."
    },
    "One sample mean t-test": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/1sample_t.html",
        "window":"Testing whether the population mean (estimated using the sample mean) is likely to be equal to a hypothesized value."
},
    "One sample mean Z-test": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/1sample_z.html",
        "window":"Testing whether the population mean (estimated using the sample mean) is likely to be equal to a hypothesized value, when the population standard deviation is known."
},
    "One sample Stdev test": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/1sample_dev.html",
        "window":"Testing whether the population standard deviation (estimated using the sample) is likely to be equal to a hypothesized value. Both Chi sq and Bonett tests will be performed."
},
    "One Proportion Test": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/1sample_prop.html",
        "window":"Use 1 Proportion to estimate a population proportion and to compare the proportion to a target value. The test includes binomial exact, normal approximate and chi square results."
},
    "Two samples t-test": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/2sample_t.html",
        "window":"Test whether mean values of two sample sets have their difference being equal to the hypothesized value."
},
    "Paired t-test": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/paired_t.html",
        "window":"A paired t-test determines if there is a significant difference between the means of two related groups of measurements (like before and after scores from the same subjects) by analyzing the differences between each pair of observations."
},
    "Two Proportions Test": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/2sample_prop.html",
        "window":"When your data contain only two categories, such as pass/fail, use the two proportions test to determine whether the population proportions of two groups differ."
},
    "Mutli-sample Stdev Test": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/multi_sample_dev.html",
        "window":"Test if standard deviations of all the samples are equal. Data need to be in separated columns. If data are stacked in one column, use Split Data Column in Data Menu. Select multiple columns with CTRL+click and SHIFT+click."
},
    "One-Way ANOVA": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/anova_1way.html",
        "window":"Use One-Way ANOVA to determine whether the population means of two or more groups differ. If the ANOVA finds that at least one group is different, perform a comparisons analysis to identify pairs of groups that are significantly different. The input data can be a stack of continuous responses and corresponding a categorical factor column, or separated columns of continuous samples."
},
    "Two-Way ANOVA": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/anova_2way.html",
        "window":"The two-way ANOVA compares the mean differences between groups that have been split on two independent variables (called factors). Use a two-way ANOVA when you want to know how two independent categorical variables (factors), in combination, affect a dependent variable (response)."
},
"Contingency Table and Chi SQ Test": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/chi2.html",
        "window":"Use Cross Tabulation and Chi-Square analysis when your data is categorized by two categorical variables. Input the categorical data with two columns. Use a summarized table when the rows and columns contain total counts for each cross-category."
},
"Propabilities Chi SQ Test": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/chi2_prob.html",
        "window":"Test the estimated probabilities of the levels of a categorical variable against the specified hypothesized probabilities."
},
"Crossed Gage R&R": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/grr.html",
        "window":"Gage R&R (Repeatability and Reproducibility) is a statistical technique used to assess the reliability and consistency of a measurement system. It helps determine how much of the observed variation in measurements is due to the equipment and operators versus actual differences in the items being measured."
}
}
