{
    "__comment": "link is the weblink for HELP button. Window is for the brief description for each dialog.",
    "Main Help Menu": {
        "link": "https://minijmp.readthedocs.io/en/latest/",
        "window": ""},
    "Stats Summary": {
        "link": "https://minijmp.readthedocs.io/en/latest/usage/describe.html",
        "window": "Generate statistical summaries such as Mean and Median for a single dataset, i.e. one column of data. The statistical measures are set by default, while percentile positions can be customized."},
    "Stats Summary Multi Datasets": {
        "link": "https://minijmp.readthedocs.io/en/latest/usage/describe_multivar.html",
        "window": "Generate statistical summaries, including measures such as Mean and Median, for multiple datasets (several columns of data). Users can select which statistical measures to include in the final output table."},
    "Normality Test": {
        "link": "https://minijmp.readthedocs.io/en/latest/usage/normality.html",
        "window": "Perform normality test to one column of data. Shapiro-Wilk and Anderson-Darling tests will be performed." 
    },
    "Confidence Intervals": {
        "link": "https://minijmp.readthedocs.io/en/latest/usage/ci.html",
        "window": "Calculate and display the confidence intervals for the population mean and standard deviation using the sampling dataset, assuming the underlying population follows a normal distribution."
    },
    "Fit Distributions": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/fit_dist.html",
        "window": "A fitted distribution is a theoretical distribution calculated using parameter estimates derived from a sample that you enter. This dialog can help to find the most suitable distribution to the sample. If plotting required, please use Plots>Histogram & Dist. Fit, however which can't compare across distributions."
    },
    "Correlation": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/cor.html",
        "window":"Calculate correlation between two data columns and draw a scatter plot. Correlation ellipse can be drawn when Pearson's Correlation is selected."
    },
    "Linear Regression": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/linear_fit.html",
        "window":"Find the linear model that best describes how the response variable (Y) changes with the predictor variable (X), using the least squares estimation method which minimizes the sum of the squared distances between the points and the fitted line. "
    },
    "Residual Plots": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/residuals.html",
        "window":"A supplimental tool of Linear Regression to plot Residuals versus fits, Residuals versus order, Histogram of residuals and QQ plot of normality test.\nChoose the predictor variable (X) and the response variable (Y) of the Linear Regression."
    },
    "Orthogonal Regression": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/orthogonal.html",
        "window":"Calculate the orthogonal regression of the variables, which considering both predictor and response carrying measurement errors."
    },
    "Multi Column Correlation": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/multi_cor.html",
        "window":"Select multiple variables using CTRL-click for individual selections or SHIFT-click for ranges. Calculate correlations simultaneously using one or multiple algorithm(s) of your choice."
    },
    "One sample mean t-test": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/1sample_t.html",
        "window":"Testing whether the population mean (estimated using the sample mean) is likely to be equal to a hypothesized value."
},
    "One sample mean Z-test": {
        "link":"https://minijmp.readthedocs.io/en/latest/usage/1sample_z.html",
        "window":"Testing whether the population mean (estimated using the sample mean) is likely to be equal to a hypothesized value, when the population standard deviation is known."
}
}
